
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 异构并行计算 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    REMDME
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 异构并行计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 为什么需要更高的速度或并行性
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/README.md">
            
                <span>
            
                    
                    Chapter 2
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/section2.1.md">
            
                <span>
            
                    
                    Section 2.1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/section2.2.md">
            
                <span>
            
                    
                    Section 2.2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.1 异构并行计算</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="11-&#x5F02;&#x6784;&#x5E76;&#x884C;&#x8BA1;&#x7B97;">1.1 &#x5F02;&#x6784;&#x5E76;&#x884C;&#x8BA1;&#x7B97;</h2>
<p>&#x200B;    &#x81EA;2003&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x534A;&#x5BFC;&#x4F53;&#x884C;&#x4E1A;&#x5728;&#x8BBE;&#x8BA1;&#x5FAE;&#x5904;&#x7406;&#x5668;&#x65F6;&#x786E;&#x7ACB;&#x4E86;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x8DEF;&#x5F84;(<a href="https://www.researchgate.net/publication/260711393_Computer_Architecture_and_Amdahl&apos;s_Law" target="_blank">Hwu et al., 2008</a>)&#x3002;&#x591A;&#x6838;&#x8DEF;&#x5F84;&#x65E8;&#x5728;&#x8F6C;&#x5411;&#x591A;&#x6838;&#x7684;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x987A;&#x5E8F;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x3002;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x6700;&#x521D;&#x4ECE;&#x53CC;&#x6838;&#x5904;&#x7406;&#x5668;&#x5F00;&#x59CB;&#xFF0C;&#x968F;&#x7740;&#x6BCF;&#x4E00;&#x4EE3;&#x534A;&#x5BFC;&#x4F53;&#x5DE5;&#x827A;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x6838;&#x5FC3;&#x6570;&#x91CF;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x3002;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x82F1;&#x7279;&#x5C14;&#x7684;&#x4E00;&#x6B3E;&#x591A;&#x6838;&#x670D;&#x52A1;&#x5668;&#x5FAE;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5B83;&#x6700;&#x591A;&#x62E5;&#x6709;24&#x4E2A;&#x5904;&#x7406;&#x5668;&#x6838;&#x5FC3;&#xFF0C;&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x3001;&#x591A;&#x6307;&#x4EE4;&#x53D1;&#x5C04;&#x7684;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x5B8C;&#x6574;&#x7684;386&#x6307;&#x4EE4;&#x96C6;&#xFF0C;&#x652F;&#x6301;&#x8D85;&#x7EBF;&#x7A0B;&#x6280;&#x672F;&#xFF08;&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x6709;&#x4E24;&#x4E2A;&#x786C;&#x4EF6;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x65E8;&#x5728;&#x6700;&#x5927;&#x5316;&#x987A;&#x5E8F;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;ARM Ampere&#x6700;&#x8FD1;&#x63A8;&#x51FA;&#x7684;&#x4E00;&#x6B3E;&#x591A;&#x6838;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x62E5;&#x6709;128&#x4E2A;&#x5904;&#x7406;&#x5668;&#x6838;&#x5FC3;&#x3002;</p>
<p>&#x200B;    &#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x8DEF;&#x5F84;&#x66F4;&#x52A0;&#x6CE8;&#x91CD;&#x5E76;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x541E;&#x5410;&#x91CF;&#x3002;&#x591A;&#x7EBF;&#x7A0B;&#x8DEF;&#x5F84;&#x59CB;&#x4E8E;&#x5927;&#x91CF;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E00;&#x4EE3;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4E5F;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x3002;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x4F8B;&#x5B50;&#x662F;NVIDIA Tesla A100&#x56FE;&#x5F62;&#x5904;&#x7406;&#x5355;&#x5143;&#xFF08;GPU&#xFF09;&#xFF0C;&#x5B83;&#x62E5;&#x6709;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5728;&#x5927;&#x91CF;&#x7B80;&#x5355;&#x7684;&#x987A;&#x5E8F;&#x7BA1;&#x9053;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x81EA;2003&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x7279;&#x522B;&#x662F;GPU&#xFF0C;&#x4E00;&#x76F4;&#x5F15;&#x9886;&#x7740;&#x6D6E;&#x70B9;&#x6027;&#x80FD;&#x7684;&#x7ADE;&#x8D5B;&#x3002;&#x622A;&#x81F3;2021&#x5E74;&#xFF0C;A100 GPU&#x7684;&#x5CF0;&#x503C;&#x6D6E;&#x70B9;&#x541E;&#x5410;&#x91CF;&#x4E3A;64&#x4F4D;&#x53CC;&#x7CBE;&#x5EA6;9.7 TFLOPS&#x3001;32&#x4F4D;&#x5355;&#x7CBE;&#x5EA6;156 TFLOPS&#x4EE5;&#x53CA;16&#x4F4D;&#x534A;&#x7CBE;&#x5EA6;312 TFLOPS&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x6700;&#x8FD1;&#x7684;&#x82F1;&#x7279;&#x5C14;24&#x6838;&#x5904;&#x7406;&#x5668;&#x7684;&#x53CC;&#x7CBE;&#x5EA6;&#x5CF0;&#x503C;&#x6D6E;&#x70B9;&#x541E;&#x5410;&#x91CF;&#x4E3A;0.33 TFLOPS&#xFF0C;&#x5355;&#x7CBE;&#x5EA6;&#x4E3A;0.66 TFLOPS&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x4E2D;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;GPU&#x548C;&#x591A;&#x6838;CPU&#x4E4B;&#x95F4;&#x7684;&#x5CF0;&#x503C;&#x6D6E;&#x70B9;&#x8BA1;&#x7B97;&#x541E;&#x5410;&#x91CF;&#x6BD4;&#x7387;&#x4E00;&#x76F4;&#x5728;&#x589E;&#x52A0;&#x3002;&#x8FD9;&#x4E9B;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x901F;&#x5EA6;;&#x5B83;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E9B;&#x82AF;&#x7247;&#x4E2D;&#x6267;&#x884C;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x652F;&#x6301;&#x7684;&#x539F;&#x59CB;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x200B;    &#x591A;&#x6838;&#x548C;&#x591A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5982;&#x6B64;&#x5DE8;&#x5927;&#x7684;&#x5CF0;&#x503C;&#x6027;&#x80FD;&#x5DEE;&#x8DDD;&#x5DF2;&#x7ECF;&#x79EF;&#x7D2F;&#x6210;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7684;&quot;&#x7535;&#x4F4D;&#x5DEE;&quot;,&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x523B;,&#x5FC5;&#x7136;&#x4F1A;&#x6709;&#x6240;&#x7A81;&#x7834;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5230;&#x8FBE;&#x4E86;&#x90A3;&#x4E2A;&#x65F6;&#x523B;&#x3002;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;,&#x8FD9;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x5CF0;&#x503C;&#x6027;&#x80FD;&#x5DEE;&#x8DDD;&#x5DF2;&#x7ECF;&#x4FC3;&#x4F7F;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x8005;&#x5C06;&#x5176;&#x8F6F;&#x4EF6;&#x7684;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x90E8;&#x5206;&#x8F6C;&#x79FB;&#x5230;GPU&#x4E0A;&#x6267;&#x884C;&#x3002;&#x4E5F;&#x8BB8;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;,&#x5E76;&#x884C;&#x6267;&#x884C;&#x6027;&#x80FD;&#x7684;&#x5927;&#x5E45;&#x63D0;&#x5347;&#x4F7F;&#x5F97;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B49;&#x672C;&#x8D28;&#x4E0A;&#x7531;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x7684;&#x9769;&#x547D;&#x6027;&#x65B0;&#x5E94;&#x7528;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;&#x6BEB;&#x4E0D;&#x5947;&#x602A;,&#x8FD9;&#x4E9B;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x90E8;&#x5206;&#x4E5F;&#x662F;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;:&#x5F53;&#x6709;&#x66F4;&#x591A;&#x5DE5;&#x4F5C;&#x8981;&#x505A;&#x65F6;,&#x5C31;&#x6709;&#x66F4;&#x591A;&#x673A;&#x4F1A;&#x5C06;&#x5DE5;&#x4F5C;&#x5206;&#x914D;&#x7ED9;&#x534F;&#x4F5C;&#x7684;&#x5E76;&#x884C;&#x5DE5;&#x4F5C;&#x8005;,&#x5373;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x200B;    &#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x591A;&#x7EBF;&#x7A0B;GPU&#x548C;&#x591A;&#x6838;CPU&#x4E4B;&#x95F4;&#x7684;&#x5CF0;&#x503C;&#x6027;&#x80FD;&#x5DEE;&#x8DDD;&#x5982;&#x6B64;&#x4E4B;&#x5927;&#x3002;&#x7B54;&#x6848;&#x5728;&#x4E8E;&#x8FD9;&#x4E24;&#x7C7B;&#x5904;&#x7406;&#x5668;&#x5728;&#x57FA;&#x672C;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5982;&#x56FE;1.1&#x6240;&#x793A;&#x3002;&#x56FE;1.1A&#x663E;&#x793A;&#x4E86;CPU&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5176;&#x4F18;&#x5316;&#x76EE;&#x6807;&#x662F;&#x987A;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x6027;&#x80FD;&#x3002;&#x7B97;&#x672F;&#x5355;&#x5143;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x6570;&#x636E;&#x4F20;&#x9012;&#x903B;&#x8F91;&#x7684;&#x8BBE;&#x8BA1;&#x65E8;&#x5728;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7684;&#x6709;&#x6548;&#x5EF6;&#x8FDF;&#xFF0C;&#x4EE5;&#x589E;&#x52A0;&#x6BCF;&#x5355;&#x4F4D;&#x82AF;&#x7247;&#x9762;&#x79EF;&#x548C;&#x529F;&#x8017;&#x4E3A;&#x4EE3;&#x4EF7;&#x3002;&#x5927;&#x578B;&#x672B;&#x7EA7;&#x7247;&#x4E0A;&#x7F13;&#x5B58;&#x88AB;&#x8BBE;&#x8BA1;&#x7528;&#x6765;&#x6355;&#x83B7;&#x7ECF;&#x5E38;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5C06;&#x4E00;&#x4E9B;&#x957F;&#x5EF6;&#x8FDF;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x8F6C;&#x6362;&#x4E3A;&#x77ED;&#x5EF6;&#x8FDF;&#x7684;&#x7F13;&#x5B58;&#x8BBF;&#x95EE;&#x3002;&#x590D;&#x6742;&#x7684;&#x5206;&#x652F;&#x9884;&#x6D4B;&#x903B;&#x8F91;&#x548C;&#x6267;&#x884C;&#x63A7;&#x5236;&#x903B;&#x8F91;&#x7528;&#x4E8E;&#x7F13;&#x89E3;&#x6761;&#x4EF6;&#x5206;&#x652F;&#x6307;&#x4EE4;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x901A;&#x8FC7;&#x964D;&#x4F4E;&#x64CD;&#x4F5C;&#x7684;&#x5EF6;&#x8FDF;,CPU&#x786C;&#x4EF6;&#x51CF;&#x5C11;&#x4E86;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x5EF6;&#x8FDF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x7B97;&#x672F;&#x5355;&#x5143;&#x3001;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x4F20;&#x9012;&#x903B;&#x8F91;&#x3001;&#x5927;&#x5BB9;&#x91CF;&#x7684;&#x7F13;&#x5B58;&#x5185;&#x5B58;&#x548C;&#x63A7;&#x5236;&#x903B;&#x8F91;&#x6D88;&#x8017;&#x4E86;&#x82AF;&#x7247;&#x9762;&#x79EF;&#x548C;&#x529F;&#x7387;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x672C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x7B97;&#x672F;&#x6267;&#x884C;&#x5355;&#x5143;&#x548C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x901A;&#x9053;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x9762;&#x5411;&#x5EF6;&#x8FDF;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p><figure>
    <style>
     hr {
         border: none;
         height: 2px;
         background-color: black;
         margin: 5px auto;
     }
    </style>
    <img src="../pic/chapter1/fig1.1.png" alt="&#x56FE;1.1">
    <figcaption>
        <p style="font-weight: bold;">
        &#x56FE;1.1
        </p>
           <hr style="border: none; height: 2px; background-color: black; margin: 5px auto;">
        <p style="font-family: &apos;Arial&apos;, &apos;Helvetica&apos;, sans-serif;color: #808080">
            CPU&#x548C;GPU&#x6709;&#x7740;&#x6839;&#x672C;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#xFF1A;&#xFF08;A&#xFF09;CPU&#x8BBE;&#x8BA1;&#x662F;&#x9762;&#x5411;&#x5EF6;&#x8FDF;&#x7684;&#xFF1B;&#xFF08;B&#xFF09;GPU&#x8BBE;&#x8BA1;&#x662F;&#x9762;&#x5411;&#x541E;&#x5410;&#x91CF;&#x7684;&#x3002;
        </p>
    </figcaption>
</figure>
  &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;GPU&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x53D7;&#x5230;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x7535;&#x5B50;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8BE5;&#x884C;&#x4E1A;&#x5BF9;&#x6BCF;&#x5E27;&#x89C6;&#x9891;&#x4E2D;&#x6267;&#x884C;&#x5927;&#x91CF;&#x6D6E;&#x70B9;&#x8BA1;&#x7B97;&#x548C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x80FD;&#x529B;&#x65BD;&#x52A0;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x7ECF;&#x6D4E;&#x538B;&#x529B;&#x3002;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#x4FC3;&#x4F7F;GPU&#x5382;&#x5546;&#x5BFB;&#x627E;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x5229;&#x7528;&#x82AF;&#x7247;&#x9762;&#x79EF;&#x548C;&#x529F;&#x8017;&#x9884;&#x7B97;&#x6765;&#x4E13;&#x6CE8;&#x4E8E;&#x6D6E;&#x70B9;&#x8BA1;&#x7B97;&#x548C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>&#x5728;&#x56FE;&#x5F62;&#x5E94;&#x7528;&#x4E2D;,&#x4E3A;&#x6267;&#x884C;&#x89C6;&#x70B9;&#x53D8;&#x6362;&#x548C;&#x7269;&#x4F53;&#x6E32;&#x67D3;&#x7B49;&#x4EFB;&#x52A1;&#x800C;&#x9700;&#x8981;&#x6BCF;&#x79D2;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x6D6E;&#x70B9;&#x8BA1;&#x7B97;,&#x8FD9;&#x4E00;&#x9700;&#x6C42;&#x662F;&#x76F8;&#x5F53;&#x76F4;&#x89C2;&#x7684;&#x3002;&#x6B64;&#x5916;,&#x6BCF;&#x79D2;&#x6267;&#x884C;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x9700;&#x6C42;&#x540C;&#x6837;&#x91CD;&#x8981;,&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x8BB8;&#x591A;&#x56FE;&#x5F62;&#x5E94;&#x7528;&#x7684;&#x901F;&#x5EA6;&#x53D7;&#x9650;&#x4E8E;&#x6570;&#x636E;&#x4ECE;&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x4F20;&#x8F93;&#x5230;&#x5904;&#x7406;&#x5668;(&#x53CD;&#x4E4B;&#x4EA6;&#x7136;)&#x7684;&#x901F;&#x7387;&#x3002;GPU&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5728;&#x5176;DRAM&#xFF08;&#x52A8;&#x6001;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x5B58;&#x50A8;&#x5668;&#xFF09;&#x7684;&#x56FE;&#x5F62;&#x5E27;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x9AD8;&#x901F;&#x79FB;&#x52A8;&#x6781;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x79FB;&#x52A8;&#x4F7F;&#x89C6;&#x9891;&#x663E;&#x793A;&#x6548;&#x679C;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x5E76;&#x4E14;&#x6EE1;&#x8DB3;&#x6E38;&#x620F;&#x73A9;&#x5BB6;&#x7684;&#x9700;&#x6C42;&#x3002;&#x6E38;&#x620F;&#x5E94;&#x7528;&#x666E;&#x904D;&#x63A5;&#x53D7;&#x7684;&#x5BBD;&#x677E;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF08;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;I/O&#x8BBE;&#x5907;&#x671F;&#x671B;&#x5176;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x65B9;&#x5F0F;&#x7684;&#x6A21;&#x578B;&#xFF09;&#x4E5F;&#x4F7F;&#x5F97;GPU&#x66F4;&#x5BB9;&#x6613;&#x652F;&#x6301;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x5E76;&#x884C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x901A;&#x7528;&#x5904;&#x7406;&#x5668;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x6765;&#x81EA;&#x4F20;&#x7EDF;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;I/O&#x8BBE;&#x5907;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#x5BF9;&#x652F;&#x6301;&#x5E76;&#x884C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x591A;&#x6311;&#x6218;&#xFF0C;&#x56E0;&#x6B64;&#x589E;&#x52A0;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x541E;&#x5410;&#x91CF;&#xFF08;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x5185;&#x5B58;&#x5E26;&#x5BBD;&#xFF09;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x56FE;&#x5F62;&#x82AF;&#x7247;&#x7684;&#x5185;&#x5B58;&#x5E26;&#x5BBD;&#x5927;&#x7EA6;&#x662F;&#x540C;&#x65F6;&#x671F;&#x53EF;&#x7528;&#x7684;CPU&#x82AF;&#x7247;&#x7684;10&#x500D;&#x5DE6;&#x53F3;&#xFF0C;&#x6211;&#x4EEC;&#x9884;&#x8BA1;&#x5728;&#x76F8;&#x5F53;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;GPU&#x5728;&#x5185;&#x5B58;&#x5E26;&#x5BBD;&#x65B9;&#x9762;&#x4ECD;&#x5C06;&#x4FDD;&#x6301;&#x4F18;&#x52BF;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 第一章 引言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.2.html" class="navigation navigation-next " aria-label="Next page: 1.2 为什么需要更高的速度或并行性">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 异构并行计算","level":"1.2.1","depth":2,"next":{"title":"1.2 为什么需要更高的速度或并行性","level":"1.2.2","depth":2,"path":"chapter1/1.2.md","ref":"chapter1/1.2.md","articles":[]},"previous":{"title":"第一章 引言","level":"1.2","depth":1,"path":"chapter1/README.md","ref":"chapter1/README.md","articles":[{"title":"1.1 异构并行计算","level":"1.2.1","depth":2,"path":"chapter1/1.1.md","ref":"chapter1/1.1.md","articles":[]},{"title":"1.2 为什么需要更高的速度或并行性","level":"1.2.2","depth":2,"path":"chapter1/1.2.md","ref":"chapter1/1.2.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/1.1.md","mtime":"2024-06-24T02:15:00.664Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-06-24T15:33:40.728Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

