
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.2 为什么需要更高的速度或并行性 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.3.html" />
    
    
    <link rel="prev" href="1.1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    REMDME
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 异构并行计算
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 为什么需要更高的速度或并行性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 加速实际应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 并行编程的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="1.5.html">
            
                <a href="1.5.html">
            
                    
                    1.5 相关的并行编程接口
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/README.md">
            
                <span>
            
                    
                    Chapter 2
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/section2.1.md">
            
                <span>
            
                    
                    Section 2.1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/section2.2.md">
            
                <span>
            
                    
                    Section 2.2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.2 为什么需要更高的速度或并行性</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="12-&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7684;&#x901F;&#x5EA6;&#x6216;&#x5E76;&#x884C;&#x6027;">1.2 &#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7684;&#x901F;&#x5EA6;&#x6216;&#x5E76;&#x884C;&#x6027;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;<a href="1.1.html">1.1&#x8282;</a>&#x4E2D;&#x6240;&#x8FF0;&#xFF0C;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x672A;&#x6765;&#x7684;&#x786C;&#x4EF6;&#x4E16;&#x4EE3;&#x4E2D;&#x80FD;&#x591F;&#x6301;&#x7EED;&#x83B7;&#x5F97;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x5173;&#x4E8E;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x3001;&#x9AD8;&#x7EA7;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x7684;&#x7AE0;&#x8282;&#xFF08;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x548C;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#xFF0C;&#x7B2C;7&#x81F3;19&#x7AE0;&#xFF09;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9002;&#x5408;&#x5E76;&#x884C;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x5728;GPU&#x4E0A;&#x7684;&#x826F;&#x597D;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x6BD4;&#x5728;&#x5355;&#x4E2A;CPU&#x6838;&#x5FC3;&#x4E0A;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x5B9E;&#x73B0;100&#x591A;&#x500D;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x6211;&#x4EEC;&#x6240;&#x79F0;&#x7684;&quot;&#x6570;&#x636E;&#x5E76;&#x884C;&#x6027;&quot;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x9700;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;10&#x591A;&#x500D;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x9700;&#x8981;&#x6301;&#x7EED;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#x3002;&#x8BB8;&#x591A;&#x73B0;&#x6709;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F3C;&#x4E4E;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x5F97;&#x8DB3;&#x591F;&#x5FEB;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x5F53;&#x4ECA;&#x4E16;&#x754C;&#x5DF2;&#x7ECF;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x8BB8;&#x591A;&#x672A;&#x6765;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x5927;&#x4F17;&#x5E02;&#x573A;&#x5E94;&#x7528;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6211;&#x4EEC;&#x4EE5;&#x524D;&#x8BA4;&#x4E3A;&#x7684;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x5E94;&#x7528;&#x6216;&#x8D85;&#x7EA7;&#x5E94;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x751F;&#x7269;&#x5B66;&#x7814;&#x7A76;&#x793E;&#x533A;&#x6B63;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x8FDB;&#x5165;&#x5206;&#x5B50;&#x5C42;&#x9762;&#x3002;&#x663E;&#x5FAE;&#x955C;&#xFF0C;&#x4F5C;&#x4E3A;&#x5206;&#x5B50;&#x751F;&#x7269;&#x5B66;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4EEA;&#x5668;&#xFF0C;&#x8FC7;&#x53BB;&#x4F9D;&#x8D56;&#x5149;&#x5B66;&#x6216;&#x7535;&#x5B50;&#x4EEA;&#x5668;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EEA;&#x5668;&#x5728;&#x5206;&#x5B50;&#x5C42;&#x9762;&#x7684;&#x89C2;&#x5BDF;&#x4E0A;&#x6709;&#x5176;&#x5C40;&#x9650;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x5C40;&#x9650;&#x6027;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED3;&#x5408;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x901A;&#x8FC7;&#x6A21;&#x62DF;&#x5E95;&#x5C42;&#x7684;&#x5206;&#x5B50;&#x6D3B;&#x52A8;&#x6765;&#x6709;&#x6548;&#x89E3;&#x51B3;&#x3002;&#x901A;&#x8FC7;&#x6A21;&#x62DF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x66F4;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x9A8C;&#x8BC1;&#x66F4;&#x591A;&#x4EC5;&#x4F9D;&#x9760;&#x4F20;&#x7EDF;&#x4EEA;&#x5668;&#x65E0;&#x6CD5;&#x60F3;&#x8C61;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x5728;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x62DF;&#x5C06;&#x7EE7;&#x7EED;&#x4ECE;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x7684;&#x63D0;&#x9AD8;&#x4E2D;&#x53D7;&#x76CA;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x591F;&#x5728;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5185;&#x6A21;&#x62DF;&#x66F4;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x751F;&#x7269;&#x7CFB;&#x7EDF;&#x548C;&#x66F4;&#x957F;&#x7684;&#x53CD;&#x5E94;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E9B;&#x6539;&#x8FDB;&#x5C06;&#x5BF9;&#x79D1;&#x5B66;&#x548C;&#x533B;&#x5B66;&#x4EA7;&#x751F;&#x6DF1;&#x8FDC;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x89C6;&#x9891;&#x548C;&#x97F3;&#x9891;&#x7F16;&#x7801;&#x4E0E;&#x5904;&#x7406;&#x7B49;&#x5E94;&#x7528;&#xFF0C;&#x60F3;&#x60F3;&#x6211;&#x4EEC;&#x5BF9;&#x6570;&#x5B57;&#x9AD8;&#x6E05;&#xFF08;HD&#xFF09;&#x7535;&#x89C6;&#x7684;&#x6EE1;&#x610F;&#x5EA6;&#xFF0C;&#x76F8;&#x8F83;&#x4E8E;&#x65E7;&#x7684;NTSC&#x7535;&#x89C6;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x4F53;&#x9A8C;&#x4E86;&#x9AD8;&#x6E05;&#x7535;&#x89C6;&#x753B;&#x9762;&#x7684;&#x7EC6;&#x8282;&#x6C34;&#x5E73;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x518D;&#x56DE;&#x5230;&#x65E7;&#x6280;&#x672F;&#x4E86;&#x3002;&#x4F46;&#x8981;&#x8003;&#x8651;&#x5230;&#x5B9E;&#x73B0;&#x9AD8;&#x6E05;&#x7535;&#x89C6;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x5E76;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C31;&#x50CF;&#x4E09;&#x7EF4;&#xFF08;3D&#xFF09;&#x6210;&#x50CF;&#x548C;&#x53EF;&#x89C6;&#x5316;&#x4E00;&#x6837;&#x3002;&#x5728;&#x672A;&#x6765;&#xFF0C;&#x8BF8;&#x5982;&#x89C6;&#x56FE;&#x5408;&#x6210;&#x548C;&#x4F4E;&#x5206;&#x8FA8;&#x7387;&#x89C6;&#x9891;&#x7684;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x663E;&#x793A;&#x7B49;&#x65B0;&#x529F;&#x80FD;&#x5C06;&#x9700;&#x8981;&#x7535;&#x89C6;&#x4E2D;&#x66F4;&#x591A;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3002;&#x5728;&#x6D88;&#x8D39;&#x5C42;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x89C6;&#x9891;&#x548C;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x56FE;&#x7247;&#x548C;&#x89C6;&#x9891;&#x7684;&#x7126;&#x70B9;&#x3001;&#x7167;&#x660E;&#x53CA;&#x5176;&#x4ED6;&#x5173;&#x952E;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x66F4;&#x9AD8;&#x7684;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x6240;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x662F;&#x66F4;&#x597D;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x3002;&#x667A;&#x80FD;&#x624B;&#x673A;&#x7528;&#x6237;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4EAB;&#x53D7;&#x5230;&#x66F4;&#x81EA;&#x7136;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x5176;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x89E6;&#x6478;&#x5C4F;&#x53EF;&#x4EE5;&#x4E0E;&#x5927;&#x5C4F;&#x7535;&#x89C6;&#x76F8;&#x5AB2;&#x7F8E;&#x3002;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x7684;&#x672A;&#x6765;&#x7248;&#x672C;&#x5C06;&#x4F1A;&#x6574;&#x5408;&#x5177;&#x6709;3D&#x89C6;&#x89D2;&#x7684;&#x4F20;&#x611F;&#x5668;&#x548C;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x7ED3;&#x5408;&#x865A;&#x62DF;&#x548C;&#x7269;&#x7406;&#x7A7A;&#x95F4;&#x4FE1;&#x606F;&#x4EE5;&#x63D0;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x8BED;&#x97F3;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7684;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x6D88;&#x8D39;&#x7535;&#x5B50;&#x6E38;&#x620F;&#x9886;&#x57DF;&#x4E5F;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7C7B;&#x4F3C;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x8FC7;&#x53BB;&#xFF0C;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#x53EA;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x9884;&#x5148;&#x5B89;&#x6392;&#x7684;&#x573A;&#x666F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8F66;&#x649E;&#x5230;&#x969C;&#x788D;&#x7269;&#xFF0C;&#x8F66;&#x8F86;&#x7684;&#x884C;&#x9A76;&#x8DEF;&#x7EBF;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#xFF1B;&#x53EA;&#x6709;&#x6E38;&#x620F;&#x5206;&#x6570;&#x4F1A;&#x53D8;&#x5316;&#x3002;&#x4F60;&#x7684;&#x8F66;&#x8F6E;&#x4E0D;&#x4F1A;&#x53D8;&#x5F62;&#x6216;&#x635F;&#x574F;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x5931;&#x53BB;&#x4E86;&#x4E00;&#x4E2A;&#x8F66;&#x8F6E;&#xFF0C;&#x9A7E;&#x9A76;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x56F0;&#x96BE;&#x3002;&#x968F;&#x7740;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x7684;&#x63D0;&#x9AD8;&#xFF0C;&#x6E38;&#x620F;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x52A8;&#x6001;&#x6A21;&#x62DF;&#x800C;&#x4E0D;&#x662F;&#x9884;&#x5148;&#x5B89;&#x6392;&#x7684;&#x573A;&#x666F;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x671F;&#x5F85;&#x5728;&#x672A;&#x6765;&#x4F53;&#x9A8C;&#x5230;&#x66F4;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x771F;&#x5B9E;&#x6548;&#x679C;&#x3002;&#x4E8B;&#x6545;&#x5C06;&#x4F1A;&#x635F;&#x574F;&#x4F60;&#x7684;&#x8F66;&#x8F6E;&#xFF0C;&#x4F60;&#x7684;&#x5728;&#x7EBF;&#x9A7E;&#x9A76;&#x4F53;&#x9A8C;&#x5C06;&#x4F1A;&#x66F4;&#x52A0;&#x903C;&#x771F;&#x3002;&#x51C6;&#x786E;&#x6A21;&#x62DF;&#x7269;&#x7406;&#x73B0;&#x8C61;&#x7684;&#x80FD;&#x529B;&#x5DF2;&#x7ECF;&#x542F;&#x53D1;&#x4E86;&#x6570;&#x5B57;&#x5B6A;&#x751F;(digital twins,)&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5373;&#x7269;&#x7406;&#x5BF9;&#x8C61;&#x5728;&#x6A21;&#x62DF;&#x7A7A;&#x95F4;&#x4E2D;&#x6709;&#x7CBE;&#x786E;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4EE5;&#x66F4;&#x4F4E;&#x7684;&#x6210;&#x672C;&#x8FDB;&#x884C;&#x5168;&#x9762;&#x7684;&#x538B;&#x529B;&#x6D4B;&#x8BD5;&#x548C;&#x52A3;&#x5316;&#x9884;&#x6D4B;&#x3002;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x7269;&#x7406;&#x6548;&#x679C;&#x7684;&#x771F;&#x5B9E;&#x5EFA;&#x6A21;&#x548C;&#x6A21;&#x62DF;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x541E;&#x5410;&#x91CF;&#x5927;&#x5E45;&#x589E;&#x52A0;&#x800C;&#x5F97;&#x5230;&#x5B9E;&#x73B0;&#x7684;&#x91CD;&#x8981;&#x65B0;&#x5E94;&#x7528;&#x662F;&#x57FA;&#x4E8E;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x867D;&#x7136;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x81EA;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x662F;&#x79EF;&#x6781;&#x7814;&#x7A76;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x8BAD;&#x7EC3;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x9700;&#x8981;&#x5927;&#x91CF;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x548C;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#xFF0C;&#x8FC7;&#x53BB;&#x5B83;&#x4EEC;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x6548;&#x679C;&#x4E0D;&#x4F73;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5174;&#x8D77;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x6807;&#x8BB0;&#x56FE;&#x7247;&#xFF0C;&#x800C;GPU&#x7684;&#x5174;&#x8D77;&#x5219;&#x5E26;&#x6765;&#x4E86;&#x8BA1;&#x7B97;&#x541E;&#x5410;&#x91CF;&#x7684;&#x6FC0;&#x589E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x81EA;2012&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x57FA;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x5E94;&#x7528;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x9886;&#x57DF;&#x5F97;&#x5230;&#x4E86;&#x5FEB;&#x901F;&#x5E94;&#x7528;&#x3002;&#x8FD9;&#x4E00;&#x5E94;&#x7528;&#x9769;&#x547D;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x5F15;&#x53D1;&#x4E86;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#x548C;&#x5BB6;&#x5EAD;&#x52A9;&#x624B;&#x8BBE;&#x5907;&#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x7684;&#x6240;&#x6709;&#x65B0;&#x5E94;&#x7528;&#x90FD;&#x6D89;&#x53CA;&#x4EE5;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x548C;&#x4E0D;&#x540C;&#x5C42;&#x6B21;&#x6A21;&#x62DF;&#x548C;/&#x6216;&#x8868;&#x793A;&#x7269;&#x7406;&#x548C;&#x5E76;&#x53D1;&#x4E16;&#x754C;&#xFF0C;&#x9700;&#x8981;&#x5904;&#x7406;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x3002;&#x9762;&#x5BF9;&#x5982;&#x6B64;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5C3D;&#x7BA1;&#x6700;&#x7EC8;&#x9700;&#x8981;&#x5728;&#x67D0;&#x4E2A;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#xFF0C;&#x4F46;&#x5927;&#x90E8;&#x5206;&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5730;&#x5728;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x4E0A;&#x8FDB;&#x884C;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6709;&#x6548;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7BA1;&#x7406;&#x53EF;&#x4EE5;&#x5BF9;&#x5E76;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x8FBE;&#x5230;&#x901F;&#x5EA6;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x5BF9;&#x4E8E;&#x6BCF;&#x5929;&#x4F7F;&#x7528;&#x6B64;&#x7C7B;&#x5E94;&#x7528;&#x7684;&#x5C11;&#x6570;&#x4E13;&#x5BB6;&#x6765;&#x8BF4;&#x901A;&#x5E38;&#x662F;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#xFF0C;&#x4F46;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4ECE;&#x5BF9;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x66F4;&#x76F4;&#x89C2;&#x7684;&#x7406;&#x89E3;&#x548C;&#x5B9E;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x77E5;&#x8BC6;&#x4E2D;&#x53D7;&#x76CA;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4EE5;&#x76F4;&#x89C2;&#x7684;&#x65B9;&#x5F0F;&#x5411;&#x90A3;&#x4E9B;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x63A5;&#x53D7;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6216;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x7A0B;&#x6B63;&#x89C4;&#x6559;&#x80B2;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x6280;&#x672F;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x65E8;&#x5728;&#x63D0;&#x4F9B;&#x8BB8;&#x591A;&#x5B9E;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x548C;&#x52A8;&#x624B;&#x7EC3;&#x4E60;&#xFF0C;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x83B7;&#x5F97;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x77E5;&#x8BC6;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x80FD;&#x591F;&#x4FC3;&#x8FDB;&#x5E76;&#x884C;&#x5B9E;&#x73B0;&#x5E76;&#x652F;&#x6301;&#x9002;&#x5F53;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7BA1;&#x7406;&#x3002;CUDA&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x5DF2;&#x7ECF;&#x5728;&#x5E9E;&#x5927;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x793E;&#x533A;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x5145;&#x5206;&#x7684;&#x9A8C;&#x8BC1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.1.html" class="navigation navigation-prev " aria-label="Previous page: 1.1 异构并行计算">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.3.html" class="navigation navigation-next " aria-label="Next page: 1.3 加速实际应用">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.2 为什么需要更高的速度或并行性","level":"1.2.2","depth":2,"next":{"title":"1.3 加速实际应用","level":"1.2.3","depth":2,"path":"chapter1/1.3.md","ref":"chapter1/1.3.md","articles":[]},"previous":{"title":"1.1 异构并行计算","level":"1.2.1","depth":2,"path":"chapter1/1.1.md","ref":"chapter1/1.1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/1.2.md","mtime":"2024-06-29T15:56:35.858Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-06-30T09:50:39.701Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

