
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.4 并行编程的挑战 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.5.html" />
    
    
    <link rel="prev" href="1.3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    REMDME
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 异构并行计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 为什么需要更高的速度或并行性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 加速实际应用
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 并行编程的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="1.5.html">
            
                <a href="1.5.html">
            
                    
                    1.5 相关的并行编程接口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="1.6.html">
            
                <a href="1.6.html">
            
                    
                    1.6 总体目标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="1.7.html">
            
                <a href="1.7.html">
            
                    
                    1.7 本书的组织结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="reference.html">
            
                <a href="reference.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/">
            
                <a href="../chapter2/">
            
                    
                    第二章 异构数据并行计算
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/2.1.html">
            
                <a href="../chapter2/2.1.html">
            
                    
                    2.1 数据并行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/2.2.html">
            
                <a href="../chapter2/2.2.html">
            
                    
                    2.2 CUDA C程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/2.3.html">
            
                <a href="../chapter2/2.3.html">
            
                    
                    2.3 一个向量加法的kernel
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../chapter2/2.4.html">
            
                <a href="../chapter2/2.4.html">
            
                    
                    2.4 global memory和数据传输
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../chapter2/2.5.html">
            
                <a href="../chapter2/2.5.html">
            
                    
                    2.5 kernel函数和线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../chapter2/2.6.html">
            
                <a href="../chapter2/2.6.html">
            
                    
                    2.6 调用kernel函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../chapter2/2.7.html">
            
                <a href="../chapter2/2.7.html">
            
                    
                    2.7 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="../chapter2/2.8.html">
            
                <a href="../chapter2/2.8.html">
            
                    
                    2.8 总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="../chapter2/exercise.html">
            
                <a href="../chapter2/exercise.html">
            
                    
                    练习题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="../chapter2/reference.html">
            
                <a href="../chapter2/reference.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.4 并行编程的挑战</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="14-&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x6311;&#x6218;">1.4 &#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x6311;&#x6218;</h3>
<p>&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#xFF1F;&#x6709;&#x4EBA;&#x66FE;&#x8BF4;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5728;&#x4E4E;&#x6027;&#x80FD;&#xFF0C;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x662F;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7684;&#x3002;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5C0F;&#x65F6;&#x5185;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x5E76;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5728;&#x4E4E;&#x6027;&#x80FD;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x8D39;&#x5FC3;&#x5199;&#x5E76;&#x884C;&#x7A0B;&#x5E8F;&#x5462;&#xFF1F;</p>
<p>&#x672C;&#x4E66;&#x8BA8;&#x8BBA;&#x4E86;&#x5728;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x4E2D;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x6240;&#x9762;&#x4E34;&#x7684;&#x51E0;&#x4E2A;&#x6311;&#x6218;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E0E;&#x987A;&#x5E8F;&#x7B97;&#x6CD5;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7B97;&#x6CD5;&#xFF08;&#x8BA1;&#x7B97;&#xFF09;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x6311;&#x6218;&#x6027;&#x3002;&#x8BB8;&#x591A;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x6267;&#x884C;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x4E0E;&#x5176;&#x987A;&#x5E8F;&#x7B97;&#x6CD5;&#x76F8;&#x540C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6709;&#x4E9B;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8D85;&#x8FC7;&#x4E86;&#x987A;&#x5E8F;&#x7B97;&#x6CD5;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6709;&#x65F6;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x505A;&#x4E86;&#x5982;&#x6B64;&#x591A;&#x7684;&#x989D;&#x5916;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x5904;&#x7406;&#x5927;&#x578B;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x65F6;&#x53CD;&#x800C;&#x8FD0;&#x884C;&#x5F97;&#x66F4;&#x6162;&#x3002;&#x8FD9;&#x5C24;&#x5176;&#x6210;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5FEB;&#x901F;&#x5904;&#x7406;&#x5927;&#x578B;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x662F;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x52A8;&#x673A;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x95EE;&#x9898;&#x80FD;&#x591F;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x7528;&#x6570;&#x5B66;&#x9012;&#x5F52;&#x6765;&#x63CF;&#x8FF0;&#x3002;&#x5E76;&#x884C;&#x5316;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x9700;&#x8981;&#x975E;&#x76F4;&#x89C2;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x5197;&#x4F59;&#x5DE5;&#x4F5C;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x7B97;&#x6CD5;&#x539F;&#x8BED;&#xFF0C;&#x5982;&#x524D;&#x7F00;&#x548C;&#xFF0C;&#x53EF;&#x4EE5;&#x4FC3;&#x8FDB;&#x5C06;&#x95EE;&#x9898;&#x7684;&#x987A;&#x5E8F;&#x9012;&#x5F52;&#x8868;&#x8FF0;&#x8F6C;&#x6362;&#x4E3A;&#x66F4;&#x52A0;&#x5E76;&#x884C;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x6B63;&#x5F0F;&#x5730;&#x4ECB;&#x7ECD;&#x5DE5;&#x4F5C;&#x6548;&#x7387;(work efficiency)&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x5C06;&#x5728;&#x7B2C;11&#x7AE0;&quot;&#x524D;&#x7F00;&#x548C;&#xFF08;&#x626B;&#x63CF;&#xFF09;&quot;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x91CD;&#x8981;&#x7684;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x5982;&#x524D;&#x7F00;&#x548C;&#x6765;&#x8BF4;&#x660E;&#x8BBE;&#x8BA1;&#x4E0E;&#x987A;&#x5E8F;&#x7B97;&#x6CD5;&#x5BF9;&#x5E94;&#x7269;&#x5177;&#x6709;&#x76F8;&#x540C;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x6743;&#x8861;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x53D7;&#x5230;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x5EF6;&#x8FDF;&#x548C;/&#x6216;&#x541E;&#x5410;&#x91CF;&#x7684;&#x9650;&#x5236;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x79F0;&#x4E3A;memory bound&#xFF1B;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;compute bound&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5219;&#x53D7;&#x5230;&#x6BCF;&#x5B57;&#x8282;&#x6570;&#x636E;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x6570;&#x91CF;&#x7684;&#x9650;&#x5236;&#x3002;&#x5728;memory bound&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x884C;&#x6267;&#x884C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x91C7;&#x7528;&#x63D0;&#x9AD8;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C;5&#x7AE0;&quot;&#x5185;&#x5B58;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x5C40;&#x90E8;&#x6027;&quot;&#x548C;&#x7B2C;6&#x7AE0;&quot;&#x6027;&#x80FD;&#x8003;&#x8651;&quot;&#x4E2D;&#x4ECB;&#x7ECD;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x5728;&#x51E0;&#x4E2A;&#x5173;&#x4E8E;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x5E94;&#x7528;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#xFF0C;&#x5E76;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x901A;&#x5E38;&#x6BD4;&#x5176;&#x987A;&#x5E8F;&#x5BF9;&#x5E94;&#x7A0B;&#x5E8F;&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7279;&#x5F81;&#x66F4;&#x654F;&#x611F;&#x3002;&#x8BB8;&#x591A;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x5E94;&#x7528;&#x9700;&#x8981;&#x5904;&#x7406;&#x5177;&#x6709;&#x5E7F;&#x6CDB;&#x53D8;&#x5316;&#x7279;&#x5F81;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5982;&#x4E0D;&#x89C4;&#x5219;&#x6216;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x548C;&#x4E0D;&#x5747;&#x5300;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x3002;&#x8FD9;&#x4E9B;&#x5927;&#x5C0F;&#x548C;&#x5206;&#x5E03;&#x7684;&#x53D8;&#x5316;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5206;&#x914D;&#x7ED9;&#x5E76;&#x884C;&#x7EBF;&#x7A0B;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x4E0D;&#x5747;&#xFF0C;&#x4ECE;&#x800C;&#x663E;&#x8457;&#x964D;&#x4F4E;&#x5E76;&#x884C;&#x6267;&#x884C;&#x7684;&#x6548;&#x7387;&#x3002;&#x5E76;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x6709;&#x65F6;&#x4F1A;&#x968F;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x800C;&#x53D1;&#x751F;&#x620F;&#x5267;&#x6027;&#x7684;&#x53D8;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4ECB;&#x7ECD;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x4ECB;&#x7ECD;&#x7528;&#x4E8E;&#x89C4;&#x8303;&#x5316;&#x6570;&#x636E;&#x5206;&#x5E03;&#x548C;/&#x6216;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4EE5;&#x5E94;&#x5BF9;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#xFF0C;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5316;&#xFF0C;&#x800C;&#x51E0;&#x4E4E;&#x4E0D;&#x9700;&#x8981;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x3002;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&quot;&#x5929;&#x7136;&#x5E76;&#x884C;&quot;&#xFF08;embarrassingly parallel&#xFF09;&#x3002;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5219;&#x9700;&#x8981;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x5C4F;&#x969C;&#x6216;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x4E9B;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#x4F1A;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E26;&#x6765;&#x5F00;&#x9500;&#xFF0C;&#x56E0;&#x4E3A;&#x7EBF;&#x7A0B;&#x7ECF;&#x5E38;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6267;&#x884C;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x5404;&#x79CD;&#x51CF;&#x5C11;&#x8FD9;&#x79CD;&#x540C;&#x6B65;&#x5F00;&#x9500;&#x7684;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x5927;&#x591A;&#x5DF2;&#x7ECF;&#x88AB;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x89E3;&#x51B3;&#x3002;&#x5728;&#x4E0D;&#x540C;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x4E4B;&#x95F4;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5171;&#x540C;&#x6A21;&#x5F0F;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5C06;&#x5728;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x4E2D;&#x5F97;&#x51FA;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5E94;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x7684;&#x6311;&#x6218;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x91CD;&#x8981;&#x7684;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x80CC;&#x666F;&#x4E0B;&#x4ECB;&#x7ECD;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.3.html" class="navigation navigation-prev " aria-label="Previous page: 1.3 加速实际应用">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.5.html" class="navigation navigation-next " aria-label="Next page: 1.5 相关的并行编程接口">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.4 并行编程的挑战","level":"1.2.4","depth":2,"next":{"title":"1.5 相关的并行编程接口","level":"1.2.5","depth":2,"path":"chapter1/1.5.md","ref":"chapter1/1.5.md","articles":[]},"previous":{"title":"1.3 加速实际应用","level":"1.2.3","depth":2,"path":"chapter1/1.3.md","ref":"chapter1/1.3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex"],"pluginsConfig":{"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/1.4.md","mtime":"2024-07-10T15:55:52.468Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-07-10T15:57:07.760Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

