
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.6 总体目标 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1.7.html" />
    
    
    <link rel="prev" href="1.5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    REMDME
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 异构并行计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 为什么需要更高的速度或并行性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 加速实际应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 并行编程的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="1.5.html">
            
                <a href="1.5.html">
            
                    
                    1.5 相关的并行编程接口
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.6" data-path="1.6.html">
            
                <a href="1.6.html">
            
                    
                    1.6 总体目标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="1.7.html">
            
                <a href="1.7.html">
            
                    
                    1.7 本书的组织结构
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/README.md">
            
                <span>
            
                    
                    Chapter 2
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/section2.1.md">
            
                <span>
            
                    
                    Section 2.1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/section2.2.md">
            
                <span>
            
                    
                    Section 2.2
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.6 总体目标</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="16-&#x603B;&#x4F53;&#x76EE;&#x6807;">1.6 &#x603B;&#x4F53;&#x76EE;&#x6807;</h3>
<p>&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x6559;&#x8BFB;&#x8005;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x5904;&#x7406;&#x5668;&#x7684;&#x7F16;&#x7A0B;&#x4EE5;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x672C;&#x4E66;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x90FD;&#x81F4;&#x529B;&#x4E8E;&#x5F00;&#x53D1;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x6280;&#x672F;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x786C;&#x4EF6;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x63A8;&#x7406;&#x548C;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x7684;&#x6027;&#x80FD;&#x8868;&#x73B0;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x5E76;&#x884C;&#x786C;&#x4EF6;&#x67B6;&#x6784;&#x6709;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x6982;&#x5FF5;&#x7406;&#x89E3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7528;&#x4E00;&#x4E9B;&#x7BC7;&#x5E45;&#x6765;&#x76F4;&#x89C2;&#x5730;&#x7406;&#x89E3;&#x57FA;&#x672C;&#x7684;&#x786C;&#x4EF6;&#x67B6;&#x6784;&#x7279;&#x6027;&#xFF0C;&#x5E76;&#x7528;&#x5927;&#x91CF;&#x7BC7;&#x5E45;&#x6765;&#x4ECB;&#x7ECD;&#x5F00;&#x53D1;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x6280;&#x672F;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E13;&#x6CE8;&#x4E8E;&#x8BA1;&#x7B97;&#x601D;&#x7EF4;&#xFF08;<a href="https://www.cs.cmu.edu/~15110-s13/Wing06-ct.pdf" target="_blank">Wing&#xFF0C;2006</a>&#xFF09;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x60A8;&#x80FD;&#x591F;&#x4EE5;&#x9002;&#x5408;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x9AD8;&#x6027;&#x80FD;&#x6267;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x601D;&#x8003;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8FDB;&#x884C;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x786C;&#x4EF6;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5F88;&#x591A;&#x5E74;&#x624D;&#x80FD;&#x6784;&#x5EFA;&#x51FA;&#x80FD;&#x591F;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5F00;&#x53D1;&#x9AD8;&#x6027;&#x80FD;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x673A;&#x5668;&#x3002;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x8BA4;&#x4E3A;&#x4E86;&#x89E3;&#x786C;&#x4EF6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x591F;&#x6BD4;&#x90A3;&#x4E9B;&#x4E0D;&#x4E86;&#x89E3;&#x786C;&#x4EF6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x591F;&#x66F4;&#x6709;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7B2C;&#x56DB;&#x7AE0;&#x201C;&#x8BA1;&#x7B97;&#x67B6;&#x6784;&#x548C;&#x8C03;&#x5EA6;&#x201D;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x4ECB;&#x7ECD;GPU&#x67B6;&#x6784;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x8BA8;&#x8BBA;&#x4E86;&#x66F4;&#x4E13;&#x4E1A;&#x7684;&#x67B6;&#x6784;&#x6982;&#x5FF5;&#xFF0C;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x8BA8;&#x8BBA;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#x6559;&#x6388;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x786E;&#x4FDD;&#x529F;&#x80FD;&#x6B63;&#x786E;&#x548C;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x8FD9;&#x5728;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x5FAE;&#x5999;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FC7;&#x53BB;&#x4ECE;&#x4E8B;&#x5E76;&#x884C;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x77E5;&#x9053;&#xFF0C;&#x4EC5;&#x4EC5;&#x8FBE;&#x5230;&#x521D;&#x6B65;&#x7684;&#x6027;&#x80FD;&#x8FD8;&#x4E0D;&#x591F;&#x3002;&#x6311;&#x6218;&#x5728;&#x4E8E;&#x4EE5;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x6027;&#x80FD;&#xFF0C;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x8C03;&#x8BD5;&#x4EE3;&#x7801;&#x5E76;&#x652F;&#x6301;&#x7528;&#x6237;&#x3002;CUDA&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x9F13;&#x52B1;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x5F62;&#x5F0F;&#x7684;&#x5C4F;&#x969C;&#x540C;&#x6B65;&#x3001;&#x5185;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x539F;&#x5B50;&#x6027;&#x6765;&#x7BA1;&#x7406;&#x5E76;&#x884C;&#x6027;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5F3A;&#x5927;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x8C03;&#x8BD5;&#x529F;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6027;&#x80FD;&#x74F6;&#x9888;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5C55;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x4E13;&#x6CE8;&#x4E8E;&#x6570;&#x636E;&#x5E76;&#x884C;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x548C;&#x9AD8;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x76EE;&#x6807;&#x662F;&#x901A;&#x8FC7;&#x63A2;&#x7D22;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x65B9;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x8DE8;&#x672A;&#x6765;&#x786C;&#x4EF6;&#x4EE3;&#x6570;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4EE5;&#x4FBF;&#x672A;&#x6765;&#x8D8A;&#x6765;&#x8D8A;&#x5E76;&#x884C;&#x5316;&#x7684;&#x673A;&#x5668;&#x80FD;&#x591F;&#x6BD4;&#x4ECA;&#x5929;&#x7684;&#x673A;&#x5668;&#x66F4;&#x5FEB;&#x5730;&#x8FD0;&#x884C;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5E2E;&#x52A9;&#x60A8;&#x638C;&#x63E1;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x4F7F;&#x60A8;&#x7684;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x65B0;&#x4E00;&#x4EE3;&#x673A;&#x5668;&#x7684;&#x6027;&#x80FD;&#x6C34;&#x5E73;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x7684;&#x5173;&#x952E;&#x662F;&#x89C4;&#x8303;&#x5316;&#x548C;&#x672C;&#x5730;&#x5316;&#x5185;&#x5B58;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#xFF0C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x5173;&#x952E;&#x8D44;&#x6E90;&#x7684;&#x6D88;&#x8017;&#x548C;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x65F6;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F00;&#x53D1;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x6280;&#x672F;&#x5BF9;&#x4E8E;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x672A;&#x6765;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E5F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x76EE;&#x6807;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6DB5;&#x76D6;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x8BB8;&#x591A;&#x539F;&#x5219;&#x548C;&#x6A21;&#x5F0F;&#xFF08;Mattson et al., 2004&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5355;&#x72EC;&#x6559;&#x6388;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x548C;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x7F6E;&#x4E8E;&#x5E76;&#x884C;&#x5316;&#x6709;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#x8FDB;&#x884C;&#x6559;&#x5B66;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x6DB5;&#x76D6;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x6B64;&#x9009;&#x62E9;&#x4E86;&#x6700;&#x6709;&#x7528;&#x548C;&#x7ECF;&#x8FC7;&#x5145;&#x5206;&#x9A8C;&#x8BC1;&#x7684;&#x6280;&#x672F;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F53;&#x524D;&#x7248;&#x672C;&#x5728;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x65B9;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x6570;&#x91CF;&#x663E;&#x8457;&#x589E;&#x52A0;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x51C6;&#x5907;&#x4E3A;&#x60A8;&#x5FEB;&#x901F;&#x6982;&#x8FF0;&#x672C;&#x4E66;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.5.html" class="navigation navigation-prev " aria-label="Previous page: 1.5 相关的并行编程接口">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1.7.html" class="navigation navigation-next " aria-label="Next page: 1.7 本书的组织结构">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.6 总体目标","level":"1.2.6","depth":2,"next":{"title":"1.7 本书的组织结构","level":"1.2.7","depth":2,"path":"chapter1/1.7.md","ref":"chapter1/1.7.md","articles":[]},"previous":{"title":"1.5 相关的并行编程接口","level":"1.2.5","depth":2,"path":"chapter1/1.5.md","ref":"chapter1/1.5.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/1.6.md","mtime":"2024-06-30T14:04:41.412Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-06-30T14:08:06.685Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

