
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.7 本书的组织结构 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="reference.html" />
    
    
    <link rel="prev" href="1.6.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    REMDME
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.1.html">
            
                <a href="1.1.html">
            
                    
                    1.1 异构并行计算
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1.2.html">
            
                <a href="1.2.html">
            
                    
                    1.2 为什么需要更高的速度或并行性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="1.3.html">
            
                <a href="1.3.html">
            
                    
                    1.3 加速实际应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="1.4.html">
            
                <a href="1.4.html">
            
                    
                    1.4 并行编程的挑战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="1.5.html">
            
                <a href="1.5.html">
            
                    
                    1.5 相关的并行编程接口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="1.6.html">
            
                <a href="1.6.html">
            
                    
                    1.6 总体目标
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.7" data-path="1.7.html">
            
                <a href="1.7.html">
            
                    
                    1.7 本书的组织结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="reference.html">
            
                <a href="reference.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/">
            
                <a href="../chapter2/">
            
                    
                    第二章 异构数据并行计算
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/2.1.html">
            
                <a href="../chapter2/2.1.html">
            
                    
                    2.1 数据并行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/2.2.html">
            
                <a href="../chapter2/2.2.html">
            
                    
                    2.2 CUDA C程序结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/2.3.html">
            
                <a href="../chapter2/2.3.html">
            
                    
                    2.3 一个向量加法的kernel
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../chapter2/2.4.html">
            
                <a href="../chapter2/2.4.html">
            
                    
                    2.4 global memory和数据传输
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../chapter2/2.5.html">
            
                <a href="../chapter2/2.5.html">
            
                    
                    2.5 kernel函数和线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../chapter2/2.6.html">
            
                <a href="../chapter2/2.6.html">
            
                    
                    2.6 调用kernel函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../chapter2/2.7.html">
            
                <a href="../chapter2/2.7.html">
            
                    
                    2.7 编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="../chapter2/2.8.html">
            
                <a href="../chapter2/2.8.html">
            
                    
                    2.8 总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="../chapter2/exercise.html">
            
                <a href="../chapter2/exercise.html">
            
                    
                    练习题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.10" data-path="../chapter2/reference.html">
            
                <a href="../chapter2/reference.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.7 本书的组织结构</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="17-&#x672C;&#x4E66;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;">1.7 &#x672C;&#x4E66;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;</h3>
<p>&#x672C;&#x4E66;&#x5206;&#x4E3A;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x6DB5;&#x76D6;&#x4E86;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x3001;&#x6570;&#x636E;&#x5E76;&#x884C;&#x6027;&#x3001;GPU&#x548C;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x7AE0;&#x8282;&#x4E3A;&#x8BFB;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x6210;&#x4E3A;GPU&#x7A0B;&#x5E8F;&#x5458;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x80FD;&#x3002;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x4ECB;&#x7ECD;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#xFF0C;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x5219;&#x6DB5;&#x76D6;&#x4E86;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x5728;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x5B66;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x80FD;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#xFF0C;&#x6839;&#x636E;&#x9700;&#x8981;&#x5F15;&#x5165;&#x5176;&#x4ED6;GPU&#x67B6;&#x6784;&#x7279;&#x6027;&#x548C;&#x4F18;&#x5316;&#x6280;&#x672F;&#x3002;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x7B2C;&#x56DB;&#x90E8;&#x5206;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x9AD8;&#x7EA7;&#x5B9E;&#x8DF5;&#xFF0C;&#x4EE5;&#x5B8C;&#x5584;&#x90A3;&#x4E9B;&#x5E0C;&#x671B;&#x6210;&#x4E3A;&#x4E13;&#x4E1A;GPU&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x8BFB;&#x8005;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x5173;&#x4E8E;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x7684;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x7B2C;2&#x81F3;&#x7B2C;6&#x7AE0;&#x3002;&#x7B2C;2&#x7AE0;&#x300A;&#x5F02;&#x6784;&#x6570;&#x636E;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x6570;&#x636E;&#x5E76;&#x884C;&#x6027;&#x548C;CUDA C&#x7F16;&#x7A0B;&#x3002;&#x672C;&#x7AE0;&#x5047;&#x8BBE;&#x8BFB;&#x8005;&#x5DF2;&#x7ECF;&#x6709;C&#x7F16;&#x7A0B;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x9996;&#x5148;&#x5C06;CUDA C&#x4F5C;&#x4E3A;C&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x3001;&#x5C0F;&#x578B;&#x6269;&#x5C55;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#xFF0C;&#x5B83;&#x652F;&#x6301;&#x5F02;&#x6784;CPU/GPU&#x8BA1;&#x7B97;&#x548C;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x5355;&#x7A0B;&#x5E8F;&#x3001;&#x591A;&#x6570;&#x636E;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x672C;&#x7AE0;&#x6DB5;&#x76D6;&#x4E86;&#x4EE5;&#x4E0B;&#x6D89;&#x53CA;&#x7684;&#x601D;&#x7EF4;&#x8FC7;&#x7A0B;&#xFF1A;(1) &#x786E;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x9700;&#x8981;&#x5E76;&#x884C;&#x5316;&#x7684;&#x90E8;&#x5206;&#xFF0C;(2) &#x9694;&#x79BB;&#x5E76;&#x884C;&#x4EE3;&#x7801;&#x6240;&#x9700;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x7528;API&#x51FD;&#x6570;&#x5728;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x8BBE;&#x5907;&#x4E0A;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;(3) &#x4F7F;&#x7528;API&#x51FD;&#x6570;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x5230;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x8BBE;&#x5907;&#xFF0C;(4) &#x5C06;&#x5E76;&#x884C;&#x90E8;&#x5206;&#x5F00;&#x53D1;&#x6210;&#x7531;&#x5E76;&#x884C;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x5185;&#x6838;&#x51FD;&#x6570;&#xFF0C;(5) &#x542F;&#x52A8;&#x5185;&#x6838;&#x51FD;&#x6570;&#x4EE5;&#x7531;&#x5E76;&#x884C;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#xFF0C;(6) &#x6700;&#x7EC8;&#x4F7F;&#x7528;API&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x56DE;&#x4E3B;&#x5904;&#x7406;&#x5668;&#x3002;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;&#x77E2;&#x91CF;&#x52A0;&#x6CD5;&#x7684;&#x5B9E;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x3002;&#x867D;&#x7136;&#x672C;&#x7AE0;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6559;&#x6388;&#x8DB3;&#x591F;&#x7684;CUDA C&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x8BFB;&#x8005;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5E76;&#x884C;CUDA C&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x5B83;&#x6DB5;&#x76D6;&#x4E86;&#x57FA;&#x4E8E;&#x4EFB;&#x4F55;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#x5F00;&#x53D1;&#x5E76;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x51E0;&#x9879;&#x57FA;&#x672C;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x7B2C;3&#x7AE0;&#x300A;&#x591A;&#x7EF4;&#x7F51;&#x683C;&#x548C;&#x6570;&#x636E;&#x300B;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;CUDA&#x7684;&#x5E76;&#x884C;&#x6267;&#x884C;&#x6A21;&#x578B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x591A;&#x7EF4;&#x7EBF;&#x7A0B;&#x7EC4;&#x7EC7;&#x5904;&#x7406;&#x591A;&#x7EF4;&#x6570;&#x636E;&#x3002;&#x672C;&#x7AE0;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x5173;&#x7EBF;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x3001;&#x7EC4;&#x7EC7;&#x3001;&#x8D44;&#x6E90;&#x7ED1;&#x5B9A;&#x548C;&#x6570;&#x636E;&#x7ED1;&#x5B9A;&#x7684;&#x6DF1;&#x5165;&#x89C1;&#x89E3;&#xFF0C;&#x4F7F;&#x8BFB;&#x8005;&#x80FD;&#x591F;&#x4F7F;&#x7528;CUDA C&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x7B2C;4&#x7AE0;&#x300A;&#x8BA1;&#x7B97;&#x67B6;&#x6784;&#x548C;&#x8C03;&#x5EA6;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;GPU&#x67B6;&#x6784;&#xFF0C;&#x91CD;&#x70B9;&#x8BB2;&#x8FF0;&#x8BA1;&#x7B97;&#x6838;&#x5FC3;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x7EBF;&#x7A0B;&#x5728;&#x8FD9;&#x4E9B;&#x6838;&#x5FC3;&#x4E0A;&#x7684;&#x8C03;&#x5EA6;&#x6267;&#x884C;&#x3002;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x5404;&#x79CD;&#x67B6;&#x6784;&#x56E0;&#x7D20;&#x53CA;&#x5176;&#x5BF9;GPU&#x67B6;&#x6784;&#x4E0A;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x900F;&#x660E;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;SIMD&#x6267;&#x884C;&#x548C;&#x63A7;&#x5236;&#x5206;&#x6B67;&#x3001;&#x591A;&#x7EBF;&#x7A0B;&#x548C;&#x5EF6;&#x8FDF;&#x5BB9;&#x5FCD;&#x5EA6;&#x4EE5;&#x53CA;&#x5360;&#x7528;&#x7387;&#x7B49;&#x6982;&#x5FF5;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x90FD;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x5B9A;&#x4E49;&#x548C;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x7B2C;5&#x7AE0;&#x300A;&#x5185;&#x5B58;&#x67B6;&#x6784;&#x548C;&#x6570;&#x636E;&#x5C40;&#x90E8;&#x6027;&#x300B;&#x5728;&#x7B2C;4&#x7AE0;&#x300A;&#x8BA1;&#x7B97;&#x67B6;&#x6784;&#x548C;&#x8C03;&#x5EA6;&#x300B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x8BA8;&#x8BBA;&#x4E86;GPU&#x7684;&#x5185;&#x5B58;&#x67B6;&#x6784;&#x3002;&#x672C;&#x7AE0;&#x8FD8;&#x8BA8;&#x8BBA;&#x4E86;&#x7528;&#x4E8E;&#x5B58;&#x50A8;CUDA&#x53D8;&#x91CF;&#x7684;&#x7279;&#x6B8A;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x5E76;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x3002;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x5206;&#x914D;&#x548C;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x7684;CUDA&#x8BED;&#x8A00;&#x7279;&#x6027;&#x3002;&#x9002;&#x5F53;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x5E76;&#x6709;&#x52A9;&#x4E8E;&#x7F13;&#x89E3;&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6D41;&#x91CF;&#x62E5;&#x5835;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7B2C;6&#x7AE0;&#x300A;&#x6027;&#x80FD;&#x8003;&#x91CF;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x5F53;&#x524D;CUDA&#x786C;&#x4EF6;&#x4E2D;&#x51E0;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6027;&#x80FD;&#x8003;&#x91CF;&#x56E0;&#x7D20;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5B83;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x4E86;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x548C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x7406;&#x60F3;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x6784;&#x6210;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x601D;&#x8003;&#x5176;&#x8BA1;&#x7B97;&#x548C;&#x6570;&#x636E;&#x7EC4;&#x7EC7;&#x51B3;&#x7B56;&#x540E;&#x679C;&#x7684;&#x6982;&#x5FF5;&#x57FA;&#x7840;&#x3002;&#x672C;&#x7AE0;&#x6700;&#x540E;&#x5217;&#x51FA;&#x4E86;GPU&#x7A0B;&#x5E8F;&#x5458;&#x5E38;&#x7528;&#x7684;&#x5E38;&#x89C1;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x6E05;&#x5355;&#xFF0C;&#x7528;&#x4E8E;&#x4F18;&#x5316;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4EFD;&#x6E05;&#x5355;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x4E2D;&#x7528;&#x6765;&#x4F18;&#x5316;&#x5404;&#x79CD;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x5173;&#x4E8E;&#x57FA;&#x672C;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x7684;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x7B2C;7&#x81F3;&#x7B2C;12&#x7AE0;&#x3002;&#x7B2C;7&#x7AE0;&#x300A;&#x5377;&#x79EF;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x5377;&#x79EF;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#xFF0C;&#x6E90;&#x4E8E;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#xFF0C;&#x8981;&#x6C42;&#x5BF9;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x6027;&#x8FDB;&#x884C;&#x7CBE;&#x7EC6;&#x7BA1;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4ECB;&#x7ECD;&#x73B0;&#x4EE3;GPU&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#x5185;&#x5B58;&#x548C;&#x7F13;&#x5B58;&#x3002;&#x7B2C;8&#x7AE0;&#x300A;&#x6A21;&#x677F;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x6A21;&#x677F;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7C7B;&#x4F3C;&#x4E8E;&#x5377;&#x79EF;&#xFF0C;&#x4F46;&#x6E90;&#x4E8E;&#x6C42;&#x89E3;&#x5FAE;&#x5206;&#x65B9;&#x7A0B;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x4F18;&#x5316;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x6027;&#x7684;&#x72EC;&#x7279;&#x673A;&#x4F1A;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4ECB;&#x7ECD;&#x7EBF;&#x7A0B;&#x548C;&#x6570;&#x636E;&#x7684;3D&#x7EC4;&#x7EC7;&#xFF0C;&#x5E76;&#x5C55;&#x793A;&#x4E86;&#x7B2C;6&#x7AE0;&#x300A;&#x6027;&#x80FD;&#x8003;&#x91CF;&#x300B;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;&#x3001;&#x9488;&#x5BF9;&#x7EBF;&#x7A0B;&#x7C92;&#x5EA6;&#x7684;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x7B2C;9&#x7AE0;&#x300A;&#x5E76;&#x884C;&#x76F4;&#x65B9;&#x56FE;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x76F4;&#x65B9;&#x56FE;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#x5206;&#x6790;&#x548C;&#x5927;&#x6570;&#x636E;&#x96C6;&#x6A21;&#x5F0F;&#x8BC6;&#x522B;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4ECB;&#x7ECD;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x4F5C;&#x4E3A;&#x534F;&#x8C03;&#x5BF9;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x5E76;&#x53D1;&#x66F4;&#x65B0;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x51CF;&#x5C11;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x5F00;&#x9500;&#x7684;&#x79C1;&#x6709;&#x5316;&#x4F18;&#x5316;&#x3002;&#x7B2C;10&#x7AE0;&#x300A;&#x5F52;&#x7EA6;&#x4E0E;&#x6700;&#x5C0F;&#x5316;&#x5206;&#x6B67;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x5F52;&#x7EA6;&#x6811;&#x6A21;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x6C47;&#x603B;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x5C55;&#x793A;&#x4E86;&#x63A7;&#x5236;&#x5206;&#x6B67;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5E76;&#x5C55;&#x793A;&#x4E86;&#x51CF;&#x8F7B;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x7684;&#x6280;&#x672F;&#x3002;&#x7B2C;11&#x7AE0;&#x300A;&#x524D;&#x7F00;&#x548C;&#xFF08;&#x626B;&#x63CF;&#xFF09;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x524D;&#x7F00;&#x548C;&#x6216;&#x626B;&#x63CF;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x7684;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x987A;&#x5E8F;&#x7684;&#x8BA1;&#x7B97;&#x8F6C;&#x6362;&#x4E3A;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4ECB;&#x7ECD;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x6982;&#x5FF5;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x7B2C;12&#x7AE0;&#x300A;&#x5408;&#x5E76;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x5E76;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5728;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#x5DE5;&#x4F5C;&#x5206;&#x914D;&#x7B56;&#x7565;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#x4E86;&#x52A8;&#x6001;&#x8F93;&#x5165;&#x6570;&#x636E;&#x8BC6;&#x522B;&#x548C;&#x7EC4;&#x7EC7;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x5173;&#x4E8E;&#x9AD8;&#x7EA7;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x5BB9;&#x4E0E;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x6240;&#x6DB5;&#x76D6;&#x7684;&#x6A21;&#x5F0F;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#xFF0C;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x80CC;&#x666F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x66F4;&#x6CE8;&#x91CD;&#x5E94;&#x7528;&#x7279;&#x5B9A;&#x7684;&#x8003;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECB;&#x7ECD;&#x65B0;&#x6280;&#x672F;&#x6216;&#x65B0;&#x7279;&#x6027;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x786E;&#x5B9A;&#x6784;&#x5EFA;&#x5E76;&#x884C;&#x6267;&#x884C;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x7684;&#x53EF;&#x9009;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5206;&#x6790;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x8F6C;&#x6362;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x5C06;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x7684;&#x6240;&#x6709;&#x6750;&#x6599;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x5305;&#x62EC;&#x7B2C;13&#x81F3;&#x7B2C;19&#x7AE0;&#x3002;&#x7B2C;13&#x7AE0;&#x300A;&#x6392;&#x5E8F;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x4E24;&#x79CD;&#x5E76;&#x884C;&#x6392;&#x5E8F;&#x5F62;&#x5F0F;&#xFF1A;&#x57FA;&#x6570;&#x6392;&#x5E8F;&#x548C;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x3002;&#x8FD9;&#x79CD;&#x9AD8;&#x7EA7;&#x6A21;&#x5F0F;&#x5229;&#x7528;&#x4E86;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;&#x66F4;&#x57FA;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x524D;&#x7F00;&#x548C;&#x548C;&#x5E76;&#x884C;&#x5F52;&#x5E76;&#x3002;&#x7B2C;14&#x7AE0;&#x300A;&#x7A00;&#x758F;&#x77E9;&#x9635;&#x8BA1;&#x7B97;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x7A00;&#x758F;&#x77E9;&#x9635;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x79CD;&#x8BA1;&#x7B97;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002;&#x672C;&#x7AE0;&#x5411;&#x8BFB;&#x8005;&#x4ECB;&#x7ECD;&#x4E86;&#x4E3A;&#x4E86;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x5E76;&#x884C;&#x8BBF;&#x95EE;&#x800C;&#x91CD;&#x65B0;&#x6392;&#x5217;&#x6570;&#x636E;&#x7684;&#x6982;&#x5FF5;&#xFF1A;&#x6570;&#x636E;&#x538B;&#x7F29;&#x3001;&#x586B;&#x5145;&#x3001;&#x6392;&#x5E8F;&#x3001;&#x8F6C;&#x7F6E;&#x548C;&#x89C4;&#x8303;&#x5316;&#x3002;&#x7B2C;15&#x7AE0;&#x300A;&#x56FE;&#x904D;&#x5386;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x56FE;&#x7B97;&#x6CD5;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5728;GPU&#x7F16;&#x7A0B;&#x4E2D;&#x9AD8;&#x6548;&#x5B9E;&#x73B0;&#x56FE;&#x641C;&#x7D22;&#x3002;&#x7AE0;&#x8282;&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#x6765;&#x5E76;&#x884C;&#x5316;&#x56FE;&#x7B97;&#x6CD5;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x4E86;&#x56FE;&#x7ED3;&#x6784;&#x5BF9;&#x9009;&#x62E9;&#x6700;&#x4F73;&#x7B97;&#x6CD5;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5EFA;&#x7ACB;&#x5728;&#x66F4;&#x57FA;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#x4E4B;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;&#x76F4;&#x65B9;&#x56FE;&#x548C;&#x5F52;&#x5E76;&#x3002;</p>
<p>&#x7B2C;16&#x7AE0;&#x300A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x662F;GPU&#x8BA1;&#x7B97;&#x4E2D;&#x4E00;&#x4E2A;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x7684;&#x9886;&#x57DF;&#x3002;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9AD8;&#x6548;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x5C06;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x8BA8;&#x8BBA;&#x7559;&#x7ED9;&#x5176;&#x4ED6;&#x8D44;&#x6599;&#x3002;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x9AD8;&#x6548;&#x5B9E;&#x73B0;&#x5229;&#x7528;&#x4E86;&#x5982;tiling&#x548C;&#x5377;&#x79EF;&#x6A21;&#x5F0F;&#x7B49;&#x6280;&#x672F;&#x3002;&#x7B2C;17&#x7AE0;&#x300A;&#x8FED;&#x4EE3;&#x78C1;&#x5171;&#x632F;&#x6210;&#x50CF;&#x91CD;&#x5EFA;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x975E;&#x7B1B;&#x5361;&#x5C14;MRI&#x91CD;&#x5EFA;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5229;&#x7528;&#x5FAA;&#x73AF;&#x878D;&#x5408;&#x548C;&#x6563;&#x5C04;&#x5230;&#x805A;&#x96C6;&#x8F6C;&#x6362;&#x7B49;&#x6280;&#x672F;&#x6765;&#x589E;&#x5F3A;&#x5E76;&#x884C;&#x6027;&#x5E76;&#x51CF;&#x5C11;&#x540C;&#x6B65;&#x5F00;&#x9500;&#x3002;&#x7B2C;18&#x7AE0;&#x300A;&#x9759;&#x7535;&#x52BF;&#x56FE;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x5206;&#x5B50;&#x53EF;&#x89C6;&#x5316;&#x548C;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x53D7;&#x76CA;&#x4E8E;&#x5904;&#x7406;&#x4E0D;&#x89C4;&#x5219;&#x6570;&#x636E;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x5E94;&#x7528;&#x4ECE;&#x7A00;&#x758F;&#x77E9;&#x9635;&#x8BA1;&#x7B97;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x7B2C;19&#x7AE0;&#x300A;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x4E0E;&#x8BA1;&#x7B97;&#x601D;&#x7EF4;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x8BA1;&#x7B97;&#x601D;&#x7EF4;&#xFF0C;&#x5373;&#x4EE5;&#x66F4;&#x6709;&#x5229;&#x4E8E;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x7684;&#x65B9;&#x5F0F;&#x5236;&#x5B9A;&#x548C;&#x89E3;&#x51B3;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x7684;&#x827A;&#x672F;&#x3002;&#x672C;&#x7AE0;&#x6DB5;&#x76D6;&#x4E86;&#x7EC4;&#x7EC7;&#x7A0B;&#x5E8F;&#x7684;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#xFF0C;&#x4F7F;&#x5176;&#x80FD;&#x591F;&#x5E76;&#x884C;&#x6267;&#x884C;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x8BA8;&#x8BBA;&#x5C06;&#x62BD;&#x8C61;&#x79D1;&#x5B66;&#x548C;&#x95EE;&#x9898;&#x7279;&#x5B9A;&#x6982;&#x5FF5;&#x8F6C;&#x5316;&#x4E3A;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#x7684;&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x751F;&#x6210;&#x9AD8;&#x8D28;&#x91CF;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#xFF08;&#x4E32;&#x884C;&#x6216;&#x5E76;&#x884C;&#xFF09;&#x7684;&#x91CD;&#x8981;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x672C;&#x7AE0;&#x8FD8;&#x8BA8;&#x8BBA;&#x4E86;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x7ED3;&#x6784;&#x53CA;&#x5176;&#x5BF9;&#x5E94;&#x7528;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BA8;&#x8BBA;&#x57FA;&#x4E8E;&#x5BF9;CUDA&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7ECF;&#x9A8C;&#x7684;&#x5B9E;&#x8DF5;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x66FF;&#x4EE3;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x8BFB;&#x8005;&#x80FD;&#x591F;&#x5728;&#x672C;&#x4E66;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5B66;&#x4F1A;&#x5728;&#x4EFB;&#x4F55;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x4E0B;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x6848;&#x4F8B;&#x7814;&#x7A76;&#xFF0C;&#x5C55;&#x793A;&#x901A;&#x8FC7;&#x521B;&#x9020;&#x6027;&#x7684;&#x8BA1;&#x7B97;&#x601D;&#x7EF4;&#x6240;&#x80FD;&#x5E26;&#x6765;&#x7684;&#x673A;&#x9047;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x90E8;&#x5206;&#x5173;&#x4E8E;&#x9AD8;&#x7EA7;&#x5B9E;&#x8DF5;&#x5305;&#x62EC;&#x7B2C;20&#x81F3;&#x7B2C;22&#x7AE0;&#x3002;&#x7B2C;20&#x7AE0;&#x300A;&#x7F16;&#x7A0B;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#x300B;&#x6DB5;&#x76D6;&#x4E86;&#x5728;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#x4E0A;&#x8FDB;&#x884C;CUDA&#x7F16;&#x7A0B;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x90FD;&#x5305;&#x62EC;CPU&#x548C;GPU&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5728;CUDA&#x4E2D;&#x4F7F;&#x7528;MPI&#x6765;&#x6574;&#x5408;&#x8282;&#x70B9;&#x95F4;&#x8BA1;&#x7B97;&#x548C;&#x8282;&#x70B9;&#x5185;&#x8BA1;&#x7B97;&#xFF0C;&#x4EE5;&#x53CA;&#x7531;&#x6B64;&#x5F15;&#x53D1;&#x7684;&#x901A;&#x4FE1;&#x95EE;&#x9898;&#x548C;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002;&#x7B2C;21&#x7AE0;&#x300A;CUDA&#x52A8;&#x6001;&#x5E76;&#x884C;&#x6027;&#x300B;&#x4ECB;&#x7ECD;&#x4E86;&#x52A8;&#x6001;&#x5E76;&#x884C;&#x6027;&#xFF0C;&#x8FD9;&#x662F;GPU&#x6839;&#x636E;&#x6570;&#x636E;&#x6216;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x5DE5;&#x4F5C;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x4E0D;&#x603B;&#x662F;&#x7B49;&#x5F85;CPU&#x6267;&#x884C;&#x3002;&#x7B2C;22&#x7AE0;&#x300A;&#x9AD8;&#x7EA7;&#x5B9E;&#x8DF5;&#x4E0E;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x300B;&#x5217;&#x51FA;&#x4E86;&#x4E00;&#x7CFB;&#x5217;CUDA&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7684;&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x548C;&#x5B9E;&#x8DF5;&#xFF0C;&#x5305;&#x62EC;&#x96F6;&#x62F7;&#x8D1D;&#x5185;&#x5B58;&#x3001;&#x7EDF;&#x4E00;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x3001;&#x591A;&#x4E2A;&#x5185;&#x6838;&#x7684;&#x540C;&#x65F6;&#x6267;&#x884C;&#x3001;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3001;&#x8C03;&#x8BD5;&#x3001;&#x6027;&#x80FD;&#x5206;&#x6790;&#x3001;&#x53CC;&#x7CBE;&#x5EA6;&#x652F;&#x6301;&#x3001;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x7F13;&#x5B58;/&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x5668;&#x5927;&#x5C0F;&#x7B49;&#x7B49;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65E9;&#x671F;&#x7248;&#x672C;&#x7684;CUDA&#x5728;CPU&#x548C;GPU&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x9650;&#x7684;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x80FD;&#x529B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x5728;CPU&#x548C;GPU&#x4E4B;&#x95F4;&#x7684;&#x4F20;&#x8F93;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x524D;&#x7248;&#x672C;&#x7684;CUDA&#x652F;&#x6301;&#x7EDF;&#x4E00;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x548C;&#x96F6;&#x62F7;&#x8D1D;&#x5185;&#x5B58;&#x7B49;&#x7279;&#x6027;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;CPU&#x548C;GPU&#x4E4B;&#x95F4;&#x65E0;&#x7F1D;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;&#x501F;&#x52A9;&#x8FD9;&#x4E9B;&#x652F;&#x6301;&#xFF0C;CUDA&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5C06;&#x53D8;&#x91CF;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x58F0;&#x660E;&#x4E3A;CPU&#x548C;GPU&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x3002;&#x8FD0;&#x884C;&#x65F6;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x7EF4;&#x62A4;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x9700;&#x6C42;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x4F18;&#x5316;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x64CD;&#x4F5C;&#xFF0C;&#x663E;&#x8457;&#x964D;&#x4F4E;&#x4E86;&#x5728;&#x91CD;&#x53E0;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E0E;&#x8BA1;&#x7B97;&#x548C;I/O&#x6D3B;&#x52A8;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x7F16;&#x7A0B;&#x590D;&#x6742;&#x6027;&#x3002;&#x5728;&#x6559;&#x6750;&#x7684;&#x5F00;&#x5934;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x663E;&#x5F0F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;API&#xFF0C;&#x8BA9;&#x8BFB;&#x8005;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x5E95;&#x5C42;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x968F;&#x540E;&#x5728;&#x7B2C;22&#x7AE0;&#x300A;&#x9AD8;&#x7EA7;&#x5B9E;&#x8DF5;&#x4E0E;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x300B;&#x4E2D;&#x4ECB;&#x7ECD;&#x4E86;&#x7EDF;&#x4E00;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x548C;&#x96F6;&#x62F7;&#x8D1D;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x867D;&#x7136;&#x672C;&#x4E66;&#x5404;&#x7AE0;&#x8282;&#x57FA;&#x4E8E;CUDA&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x5EFA;&#x7ACB;&#x4E86;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x3002;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x4EEC;&#x6700;&#x597D;&#x901A;&#x8FC7;&#x5177;&#x4F53;&#x793A;&#x4F8B;&#x6765;&#x7406;&#x89E3;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x5728;&#x7279;&#x5B9A;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5B66;&#x4E60;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x5C06;&#x77E5;&#x8BC6;&#x63A8;&#x5E7F;&#x5230;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x3002;&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x501F;&#x52A9;CUDA&#x793A;&#x4F8B;&#x7684;&#x5177;&#x4F53;&#x7ECF;&#x9A8C;&#x3002;&#x6DF1;&#x5165;&#x4E86;&#x89E3;CUDA&#x4E5F;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x6210;&#x719F;&#x5EA6;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4E0E;CUDA&#x6A21;&#x578B;&#x65E0;&#x5173;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x7B2C;23&#x7AE0;&#x300A;&#x603B;&#x7ED3;&#x4E0E;&#x5C55;&#x671B;&#x300B;&#x63D0;&#x4F9B;&#x4E86;&#x603B;&#x7ED3;&#x6027;&#x7684;&#x8BC4;&#x8BBA;&#x548C;&#x5BF9;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x7F16;&#x7A0B;&#x672A;&#x6765;&#x7684;&#x5C55;&#x671B;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5E76;&#x603B;&#x7ED3;&#x5404;&#x7AE0;&#x5982;&#x4F55;&#x5171;&#x540C;&#x52AA;&#x529B;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x76EE;&#x6807;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x9884;&#x6D4B;&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x7684;&#x5FEB;&#x901F;&#x8FDB;&#x5C55;&#x5C06;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x672A;&#x6765;&#x5341;&#x5E74;&#x4E2D;&#x6700;&#x6FC0;&#x52A8;&#x4EBA;&#x5FC3;&#x7684;&#x9886;&#x57DF;&#x4E4B;&#x4E00;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.6.html" class="navigation navigation-prev " aria-label="Previous page: 1.6 总体目标">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="reference.html" class="navigation navigation-next " aria-label="Next page: 参考文献">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.7 本书的组织结构","level":"1.2.7","depth":2,"next":{"title":"参考文献","level":"1.2.8","depth":2,"path":"chapter1/reference.md","ref":"chapter1/reference.md","articles":[]},"previous":{"title":"1.6 总体目标","level":"1.2.6","depth":2,"path":"chapter1/1.6.md","ref":"chapter1/1.6.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex"],"pluginsConfig":{"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/1.7.md","mtime":"2024-07-08T15:10:59.363Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-07-08T15:47:00.419Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

